import datetime

months_name = {
    1: "января",
    2: "февраля",
    3: "марта",
    4: "апреля",
    5: "мая",
    6: "июня",
    7: "июля",
    8: "августа",
    9: "сентября",
    10: "октября",
    11: "ноября",
    12: "декабря"

}


day_of_weeks = {
    "пн": 0,
    "вт": 1,
    "ср": 2,
    "чт": 3,
    "пт": 4,
    "cб": 5,
    "вс": 6
}

vacations_days = [datetime.datetime.strptime(i, "%d.%m.%Y")
                  for i in [
                      '10.03.2025',
                      '21.03.2025',
                      '24.03.2025',
                      '25.03.2025',
                      '01.05.2025',
                      '07.05.2025',
                      '09.05.2025',
                      '07.07.2025',
                      '30.08.2025',
                      '25.10.2025',
                      #'01.09.2025',
                      '16.12.2025'
                  ]
]

vacations_weekend = [datetime.datetime.strptime(i, "%d.%m.%Y")
                     for i in [
                         '01.09.2025',
                         '27.10.2025'
                  ]
]

